---
kind: property
id: P:Autodesk.Revit.DB.ScheduleField.MultipleValuesCustomText
source: html/9f57808d-f3cc-cb93-edbd-dcfaad79bb95.htm
---
# Autodesk.Revit.DB.ScheduleField.MultipleValuesCustomText Property

The custom multiple values text to be used when the schedule field displays multiple element values,
 used when MultipleValuesDisplayType is set to Custom .

## Syntax (C#)
```csharp
public string MultipleValuesCustomText { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null